const tp = [[`ゴールド`,`g`],[`シルバー`,`s`],[`ブロンズ`,`b`]];
let t = [];
for (let i = 0; i < tp.length; i++) {
	t[i] = `<img alt="${tp[i][0]}" src="img/trophy_${tp[i][1]}.svg" width="16px"></span>${tp[i][0]}`;
}

const d = document,
v = `<span style="vertical-align: middle;">`,
i = `<img alt="tiplight" src="../icon/mark_tiplight.svg" width="20px" style="vertical-align: sub;">取得方法詳細</a>`,
ah = `<a href="guide.html#ch`,
tx = `編のシナリオをクリアした`,

//背景用カラーコード
cC=[
	["幕末編","#bfa0d6"],
	["近未来編","#87cece"],
	["現代編","#e5ddaf"],
	["西部編","#eacc87"],
	["功夫編","#ced6b7"],
	["ＳＦ編","#e6e6e6"],
	["原始編","#a8ddcc"],
	["中世編","#f5bcbe"],
	["最終編","#cfcccd"],
],

s1=[`本能`,`知`,`技`,`時`,`力`,`心`,`鍵`],
s2=[`ブリバリ骨オノ`,`１７ダイオード`,`達人のヌンチャク`,`４４マグナム`,`最強バンテージ`,`ド根性グラブ`,`村雨`,];
let sd=[];
for (let i = 0; i < s1.length; i++) {
	sd[i]=`${s1[i]}のダンジョンで「${s2[i]}」を入手した`;
}

const lA = [
[`${v}<img alt="プラチナ" src="img/trophy_p.svg" width="16px"></span>プラチナ`, `-`, `LIVE A LIVE`, `全てのトロフィーを獲得した/全ての実績を獲得した`, ah+`01">`+i,],
[v+t[0], `最終編`, `虚しき復讐`, `最終編でオルステッドが復讐を成し遂げた`, ah+`02">`+i,],
[v+t[1], `最終編`, `破滅する世界`, `最終編でハルマゲドンが発動した`, ah+`03">`+i,],
[v+t[1], `最終編`, `無情の選択`, `最終編の魔王撃破後、オルステッドにトドメを刺した`, ah+`04">`+i,],
[v+t[1], `最終編`, `残された運命`, `最終編で主人公が全員揃っていない状態でクリアした`, ah+`05">`+i,],
[v+t[0], `最終編`, `それぞれの夜明け`, `最終編で主人公が全員揃った状態でＳｉｎオディオを倒した`, ah+`06">`+i,],
[v+t[1], `最終編`, `陽気なヌシ`, `「アムルクレチア」を倒した`, ah+`07">`+i,],
[v+t[1], `最終編`, `彷徨う古代神`, `「ユラウクス」を倒した`, ah+`08">`+i,],
[v+t[1], `最終編`, `闇に住まう怪物`, `「ジャギィイエッグ」を倒した`, ah+`09">`+i,],
[v+t[1], `最終編`, `死の予兆`, `「デスプロフェット」を倒した`, ah+`10">`+i,],
[v+t[1], `最終編`, `異空間への誘い`, `「ヘッドプラッカー」を倒した`, ah+`11">`+i,],
[v+t[0], `最終編`, `集う運命`, `最終編を開始した`, ah+`12">`+i,],
[v+t[2], `中世編`, `魔王山からの帰還`, `中世編で魔王（？）を倒した`, ah+`13">`+i,],
[v+t[2], `原始編`, `合成の達人`, `原始編の合成屋でアイテムを10回合成した`, ah+`14">`+i,],
[v+t[2], `原始編`, `鋭い眼`, `原始編の原人数当てクイズに正解した`, ah+`15">`+i,],
[v+t[2], `ＳＦ編`, `キャプテンキューブ`, `ＳＦ編のキャプテンスクウェアで遊んだ`, ah+`16">`+i,],
[v+t[2], `ＳＦ編`, `パスハッカー`, `ＳＦ編で初めてパワージャッキを使用した`, ah+`17">`+i,],
[v+t[2], `功夫編`, `心に宿した奥技`, `功夫編で奥技を弟子に伝承した`, ah+`18">`+i,],
[v+t[2], `西部編`, `悔いはなし`, `西部編でアニーに「アニーの日記」を渡した`, ah+`19">`+i,],
[v+t[2], `西部編`, `万全の態勢`, `西部編ですべての罠を仕掛けた`, ah+`20">`+i,],
[v+t[2], `現代編`, `負け知らず`, `現代編で６人の格闘家に勝利した`, ah+`21">`+i,],
[v+t[2], `近未来編`, `世紀の大発明`, `近未来編で藤兵衛の発明で大成功を出した`, ah+`22">`+i,],
[v+t[2], `近未来編`, `商売上手`, `近未来編のたい焼き屋でたい焼きを１００００円で売った`, ah+`23">`+i,],
[v+t[2], `幕末編`, `カラクリの仲間`, `幕末編で「カラクリ丸」を起動させた`, ah+`24">`+i,],
[v+t[2], `幕末編`, `浪士と忍`, `幕末編で「囚われの男」を仲間にした`, ah+`25">`+i,],
[v+t[2], `最終編`, `本能の真実`, sd[0], ah+`26">`+i,],
[v+t[2], `最終編`, `知の真実`, sd[1], ah+`27">`+i,],
[v+t[2], `最終編`, `技の真実`, sd[2], ah+`28">`+i,],
[v+t[2], `最終編`, `時の真実`, sd[3], ah+`29">`+i,],
[v+t[2], `最終編`, `力の真実`, sd[4], ah+`30">`+i,],
[v+t[2], `最終編`, `心の真実`, sd[5], ah+`31">`+i,],
[v+t[2], `最終編`, `鍵の真実`, sd[6], ah+`32">`+i,],
[v+t[2], `原始編`, `本能のままに`, `原始`+tx, ah+`33">`+i,],
[v+t[2], `ＳＦ編`, `心を知るAI`, `ＳＦ`+tx, ah+`34">`+i,],
[v+t[2], `功夫編`, `受け継がれし技`, `功夫`+tx, ah+`35">`+i,],
[v+t[2], `西部編`, `鐘の鳴る時`, `西部`+tx, ah+`36">`+i,],
[v+t[2], `現代編`, `最強への力`, `現代`+tx, ah+`37">`+i,],
[v+t[2], `近未来編`, `心の叫び`, `近未来`+tx, ah+`38">`+i,],
[v+t[2], `幕末編`, `夜明けの鍵`, `幕末`+tx, ah+`39">`+i,],
[v+t[2], `中世編`, `憎しみの魔王オディオ`, `中世`+tx, ah+`40">`+i,],
[v+t[2], `原始編`, `生きる術`, `原始編で初めてニオイに触れた`, ah+`41">`+i,],
[v+t[2], `ＳＦ編`, `バリスタ体験`, `ＳＦ編で初めてコーヒーを淹れる`, ah+`42">`+i,],
[v+t[2], `功夫編`, `伝承の器`, `功夫編で弟子達に初めて修業をつけた`, ah+`43">`+i,],
[v+t[2], `西部編`, `迎撃準備`, `西部編で罠を仕掛けた`, ah+`44">`+i,],
[v+t[2], `現代編`, `好敵手の技`, `現代編で相手の技を習得した`, ah+`45">`+i,],
[v+t[2], `近未来編`, `秘めた思い`, `近未来編で誰かの心を読んだ`, ah+`46">`+i,],
[v+t[2], `幕末編`, `忍びの道`, `幕末編で隠れ身の術を使った`, ah+`47">`+i,],
[v+t[2], `中世編`, `打倒魔王！`, `中世編で「ブライオン」を手に入れた`, ah+`48">`+i,],
],

//実績一覧表シナリオ順並び替え
lB = [lA[0],lA[45],lA[21],lA[22],lA[37],lA[41],lA[15],lA[16],lA[33],lA[46],lA[23],lA[24],lA[38],lA[42],lA[17],lA[34],lA[44],lA[20],lA[36],lA[40],lA[13],lA[14],lA[32],lA[43],lA[18],lA[19],lA[35],lA[47],lA[12],lA[39],lA[11],lA[25],lA[26],lA[27],lA[28],lA[29],lA[30],lA[31],lA[6],lA[7],lA[8],lA[9],lA[10],lA[1],lA[2],lA[3],lA[4],lA[5],];

const tb = d.querySelector("tbody");
const btn = d.getElementById("button_id");
let isLA = true;

function renderTable(data) {
	tb.innerHTML = "";
	data.forEach(row => {
		const tr = d.createElement("tr");
		row.forEach((cell, index) => {
			const td = d.createElement("td");
			td.innerHTML = cell;
			for (let i = 0; i < cC.length; i++) {
				if (cell == cC[i][0]){
					td.style.backgroundColor = cC[i][1];
				}
			}
			tr.appendChild(td);
		});
		tb.appendChild(tr);
	});
}

// テーブル初期表示
renderTable(lA);

// ボタンクリックで表並び替え
btn.addEventListener("click", () => {
	isLA = !isLA;
	renderTable(isLA ? lA : lB);
	d.getElementById("sce_id").textContent = isLA ? "シナリオ" : "シナリオ（順）";
	btn.textContent = isLA ? "下の表をシナリオ毎に並び替え" : "下の表をデフォルト順に並び替え";
});