{
const tp = [[`ゴールド`,`g`],[`シルバー`,`s`],[`ブロンズ`,`b`]];

let tpt = [];
for (let i = 0; i < tp.length; i++) {
	tpt[i] = `<img alt="${tp[i][0]}" src="img/trophy_${tp[i][1]}.svg" width="16px"></span>${tp[i][0]}</td><td style="background-color:`;
}

const
d = document,

t = `</td><td>`,

c = [
	tpt[0],
	tpt[1],
	tpt[2],
	`${t}<a href="guide.html#ch`,
	` #cfcccd;">最終編${t}`,
	` #f5bcbe;">中世編${t}`,
	` #a8ddcc;">原始編${t}`,
	` #e6e6e6;">ＳＦ編${t}`,
	` #ced6b7;">功夫編${t}`,
	` #eacc87;">西部編${t}`,
	` #e5ddaf;">現代編${t}`,
	` #87cece;">近未来編${t}`,
	` #bfa0d6;">幕末編${t}`,
	`編のシナリオをクリアした`,
	`<tr><td><span style="vertical-align: middle;">`,
	`<img alt="tiplight" src="../icon/mark_tiplight.svg" width="20px" style="vertical-align: sub;">取得方法詳細</a></td></tr>`,
	`<table><thead><tr><th>PS系<br>グレード</th><th>シナリオ`,
	`</th><th>タイトル</th><th colspan="2">ゲーム内解説</th></tr></thead><tbody>`,
	`のダンジョンで「`,
],

//実績一覧表デフォルト
l = [
	`<img alt="プラチナ" src="img/trophy_p.svg" width="16px"></span>プラチナ${t}-${t}LIVE A LIVE${t}全てのトロフィーを獲得した/全ての実績を獲得した${c[3]}01">`,
	`${c[0]}${c[4]}虚しき復讐${t}最終編でオルステッドが復讐を成し遂げた${c[3]}02">`,
	`${c[1]}${c[4]}破滅する世界${t}最終編でハルマゲドンが発動した${c[3]}03">`,
	`${c[1]}${c[4]}無情の選択${t}最終編の魔王撃破後、オルステッドにトドメを刺した${c[3]}04">`,
	`${c[1]}${c[4]}残された運命${t}最終編で主人公が全員揃っていない状態でクリアした${c[3]}05">`,
	`${c[0]}${c[4]}それぞれの夜明け${t}最終編で主人公が全員揃った状態でＳｉｎオディオを倒した${c[3]}06">`,
	`${c[1]}${c[4]}陽気なヌシ${t}「アムルクレチア」を倒した${c[3]}07">`,
	`${c[1]}${c[4]}彷徨う古代神${t}「ユラウクス」を倒した${c[3]}08">`,
	`${c[1]}${c[4]}闇に住まう怪物${t}「ジャギィイエッグ」を倒した${c[3]}09">`,
	`${c[1]}${c[4]}死の予兆${t}「デスプロフェット」を倒した${c[3]}10">`,
	`${c[1]}${c[4]}異空間への誘い${t}「ヘッドプラッカー」を倒した${c[3]}11">`,
	`${c[0]}${c[4]}集う運命${t}最終編を開始した${c[3]}12">`,
	`${c[2]}${c[5]}魔王山からの帰還${t}中世編で魔王（？）を倒した${c[3]}13">`,
	`${c[2]}${c[6]}合成の達人${t}原始編の合成屋でアイテムを10回合成した${c[3]}14">`,
	`${c[2]}${c[6]}鋭い眼${t}原始編の原人数当てクイズに正解した${c[3]}15">`,
	`${c[2]}${c[7]}キャプテンキューブ${t}ＳＦ編のキャプテンスクウェアで遊んだ${c[3]}16">`,
	`${c[2]}${c[7]}パスハッカー${t}ＳＦ編で初めてパワージャッキを使用した${c[3]}17">`,
	`${c[2]}${c[8]}心に宿した奥技${t}功夫編で奥技を弟子に伝承した${c[3]}18">`,
	`${c[2]}${c[9]}悔いはなし${t}西部編でアニーに「アニーの日記」を渡した${c[3]}19">`,
	`${c[2]}${c[9]}万全の態勢${t}西部編ですべての罠を仕掛けた${c[3]}20">`,
	`${c[2]}${c[10]}負け知らず${t}現代編で６人の格闘家に勝利した${c[3]}21">`,
	`${c[2]}${c[11]}世紀の大発明${t}近未来編で藤兵衛の発明で大成功を出した${c[3]}22">`,
	`${c[2]}${c[11]}商売上手${t}近未来編のたい焼き屋でたい焼きを１００００円で売った${c[3]}23">`,
	`${c[2]}${c[12]}カラクリの仲間${t}幕末編で「カラクリ丸」を起動させた${c[3]}24">`,
	`${c[2]}${c[12]}浪士と忍${t}幕末編で「囚われの男」を仲間にした${c[3]}25">`,
	`${c[2]}${c[4]}本能の真実${t}本能${c[18]}ブリバリ骨オノ」を入手した${c[3]}26">`,
	`${c[2]}${c[4]}知の真実${t}知${c[18]}１７ダイオード」を入手した${c[3]}27">`,
	`${c[2]}${c[4]}技の真実${t}技${c[18]}達人のヌンチャク」を入手した${c[3]}28">`,
	`${c[2]}${c[4]}時の真実${t}時${c[18]}４４マグナム」を入手した${c[3]}29">`,
	`${c[2]}${c[4]}力の真実${t}力${c[18]}最強バンテージ」を入手した${c[3]}30">`,
	`${c[2]}${c[4]}心の真実${t}心${c[18]}ド根性グラブ」を入手した${c[3]}31">`,
	`${c[2]}${c[4]}鍵の真実${t}鍵${c[18]}村雨」を入手した${c[3]}32">`,
	`${c[2]}${c[6]}本能のままに${t}原始${c[13]}${c[3]}33">`,
	`${c[2]}${c[7]}心を知るAI${t}ＳＦ${c[13]}${c[3]}34">`,
	`${c[2]}${c[8]}受け継がれし技${t}功夫${c[13]}${c[3]}35">`,
	`${c[2]}${c[9]}鐘の鳴る時${t}西部${c[13]}${c[3]}36">`,
	`${c[2]}${c[10]}最強への力${t}現代${c[13]}${c[3]}37">`,
	`${c[2]}${c[11]}心の叫び${t}近未来${c[13]}${c[3]}38">`,
	`${c[2]}${c[12]}夜明けの鍵${t}幕末${c[13]}${c[3]}39">`,
	`${c[2]}${c[5]}憎しみの魔王オディオ${t}中世${c[13]}${c[3]}40">`,
	`${c[2]}${c[6]}生きる術${t}原始編で初めてニオイに触れた${c[3]}41">`,
	`${c[2]}${c[7]}バリスタ体験${t}ＳＦ編で初めてコーヒーを淹れる${c[3]}42">`,
	`${c[2]}${c[8]}伝承の器${t}功夫編で弟子達に初めて修業をつけた${c[3]}43">`,
	`${c[2]}${c[9]}迎撃準備${t}西部編で罠を仕掛けた${c[3]}44">`,
	`${c[2]}${c[10]}好敵手の技${t}現代編で相手の技を習得した${c[3]}45">`,
	`${c[2]}${c[11]}秘めた思い${t}近未来編で誰かの心を読んだ${c[3]}46">`,
	`${c[2]}${c[12]}忍びの道${t}幕末編で隠れ身の術を使った${c[3]}47">`,
	`${c[2]}${c[5]}打倒魔王！${t}中世編で「ブライオン」を手に入れた${c[3]}48">`,
],

//実績一覧表シナリオ順並び替え
lS = [l[0],l[45],l[21],l[22],l[37],l[41],l[15],l[16],l[33],l[46],l[23],l[24],l[38],l[42],l[17],l[34],l[44],l[20],l[36],l[40],l[13],l[14],l[32],l[43],l[18],l[19],l[35],l[47],l[12],l[39],l[11],l[25],l[26],l[27],l[28],l[29],l[30],l[31],l[6],l[7],l[8],l[9],l[10],l[1],l[2],l[3],l[4],l[5],],

scenarioEl = d.getElementById("scenario"),
defaultEl = d.getElementById("default");

//「下の表をデフォルト順に並び替え」ボタンは初期状態で非表示にする
defaultEl.style.display = "none";

//「下の表をシナリオ毎に並び替え」ボタンを押した時の動作
scenarioEl.addEventListener("click", () => {
	let lText = `${c[16]}（順）${c[17]}`;
	for (let i = 0; i < lS.length; i++) {
		lText += c[14] + lS[i] + c[15];
	}
	d.getElementById('view').innerHTML = lText + `</tbody></table>`;
	scenarioEl.style.display = "none";
	defaultEl.style.display = "";
});

//「下の表をデフォルト順に並び替え」ボタンを押した時の動作
defaultEl.addEventListener("click", () => {
	let lText = c[16] + c[17];
	for (let i = 0; i < l.length; i++) {
		lText += c[14] + l[i] + c[15];
	}
	d.getElementById('view').innerHTML = lText + `</tbody></table>`;
	defaultEl.style.display = "none";
	scenarioEl.style.display = "";
});

}