{
//敵パーティ一覧と取得経験値の一覧表JavaScript

const d = document;

// フォーム文字数を2文字までに制限
const input = d.getElementById("num1");
input.addEventListener("input", function () {
	// 入力値を文字列として取得
	let value = input.value;
	if (value.length > 2) {
		input.value = value.slice(0, 2);
	}
});

//シナリオ
const SNo = ["近未来","ＳＦ","幕末","功夫","現代","原始","西部","中世","最終",];

//リーダー印
const leader = '<img src="../icon/leaderflag.svg" class="flag" alt="LEADER">';

//シナリオ毎　敵パーティ一覧
const enemP_kinm = [
[`${leader}クルセイダー`,1,`ＲＣ１号（※1）`,3,"","","","",6,],
[`${leader}クルセイダー`,1,`ＲＣ１号（※2）`,3,"","","","",6,],
[`${leader}クルセイダー`,1,`ラリアット１号`,2,"","","","",7,],
[`${leader}クルセイダー`,1,`ＲＣ２号（※3）`,8,"","","","",8,],
[`${leader}クルセイダー`,1,`ＲＣ２号（※4）`,8,"","","","",8,],
[`${leader}クルセイダー`,1,`ラリアット１号`,1,`ＲＣ２号`,3,"","",7,],
[`${leader}クルセイダー`,1,`キョクシン１号`,3,"","","","",9,],
[`${leader}クルセイダーＲＳ`,1,`ラリアット１号`,2,`ラリアット２号`,2,"","",10,],
[`${leader}クルセイダーＲＳ`,1,`ブル・コマツ１号`,1,`ＲＣ２号`,4,"","",11,],
[`${leader}クルセイダー`,1,`キョクシン１号`,1,`ＲＣ２号`,6,"","",9,],
[`${leader}クルセイダーＲＳ`,1,`ラリアット１号`,2,`ラリアット３号`,2,`ラリアット２号`,2,12,],
[`${leader}クルセイダーＲＳ`,1,`キョクシン１号`,1,`ラリアット１号`,2,"","",10,],
[`${leader}クルセイダーＲＳ`,1,`ブル・コマツ１号`,1,`ラリアット１号`,3,"","",11,],
[`${leader}クルセイリーダー`,1,`へーベル１号`,7,"","","","",13,],
[`${leader}クルセイダーＲＳ`,1,`サイコ１号`,3,"","","","",14,],
[`${leader}クルセイダーＲＳ`,1,`ラリアット１号`,2,`ラリアット２号`,2,`ラリアット３号`,1,12,],
[`${leader}クルセイダーＲＳ`,1,`サイコ１号`,2,`へーベル１号`,2,"","",14,],
[`${leader}クルセイリーダー`,1,`ブル・コマツ１号`,1,`キョクシン１号`,3,"","",13,],
[`${leader}クルセイリーダー`,1,`キョクシン２号`,1,`へーベル１号`,7,`ＲＣ２号`,4,15,],
[`${leader}クルセイリーダー`,1,`キョクシン２号`,2,`ブル・コマツ１号`,1,`ラリアット３号`,2,15,],
[`クルセイダー`,3,`クルセイリーダー`,1,"","","","",3,],
[`クルセイダー`,3,"","","","","","",1,],
[`黒服`,2,"","","","","","",9,],
[`ドーベルマン１号`,1,`${leader}黒服`,1,"","","","",9,],
[`${leader}クルセイダーＲＳ`,4,`ラリアット２号`,3,"","","","",10,],
[`ガードマン`,8,"","","","","","",9,],
[`${leader}ガードマン`,1,`ＲＣ２号`,12,"","","","",1,],
[`ジェネラル`,1,"","","","","","",9,],
[`液体人間Ｗ１号`,1,"","","","","","",12,],
[`翔電`,3,"","","","","","",`-`,`-`,],
[`９３式中戦車`,4,"","","","","","",`-`,`-`,],
[`翔電`,5,"","","","","","",`-`,`-`,],
[`９３式中戦車`,14,"","","","","","",`-`,`-`,],
[`怒竜（※5）`,1,"","","","","","",`-`,`-`,],
[`怒竜（※6）`,1,"","","","","","",`-`,`-`,],
[`大隠呼像`,1,"","","","","","",`-`,`-`,],
];

const enemP_sf = [
[`クリッカーロック`,4,"","","","","","",`-`,],
[`ヘディングバード`,6,"","","","","","",`-`,],
[`ファイア`,1,`ウォーター`,4,"","","","",`-`,],
[`${leader}マザーテイル`,1,`パピーテイル`,6,"","","","",`-`,],
[`コスモストローラ`,6,"","","","","","",`-`,],
[`ジェムパラペット`,3,"","","","","","",`-`,],
[`${leader}エレ・ミラージュ`,1,`ピムリ`,14,"","","","",`-`,],
[`ラ・ル`,14,`${leader}ラ・ラ`,1,"","","","",`-`,],
[`ポルカドットＱ`,3,`ポルカドットＲ`,3,`ポルカドットＺ`,3,`ポルカドットＸ`,3,`-`,],
[`${leader}マザーＣＯＭ`,1,`スタビライザー`,8,"","","","",`-`,],
];

const enemP_baku = [
[`奴`,2,"","","","","","",5,],
[`奴`,1,"","","","","","",4,],
[`浪人`,1,"","","","","","",5,],
[`藩士`,1,"","","","","","",5,],
[`腰元`,1,"","","","","","",3,],
[`家老`,1,`燭台`,4,"","","","",3,],
[`忍者`,1,"","","","","","",5,],
[`忍者`,2,"","","","","","",6,],
[`忍者`,4,"","","","","","",9,],
[`商人`,1,"","","","","","",3,],
[`強藩士`,1,"","","","","","",7,],
[`外国人`,1,"","","","","","",3,],
[`くの一`,1,`障子`,7,"","","","",5,],
[`ひとだま`,1,"","","","","","",8,],
[`おきょう`,1,`燭台`,4,"","","","",8,],
[`おミケ`,1,`障子`,6,`燭台`,2,"","",6,],
[`${leader}五忍者（本体）`,1,`五忍者（分身）`,4,"","","","",8,],
[`般若丸`,1,`燭台`,4,"","","","",8,],
[`狂四郎`,1,`燭台`,4,"","","","",10,],
[`五エ門`,1,"","","","","","",8,],
[`${leader}とんちボウズ`,1,`虎`,1,"","","","",6,],
[`オカメの方`,1,"","","","","","",9,],
[`虚無僧`,3,"","","","","","",9,],
[`八剣士`,8,"","","","","","",10,],
[`${leader}仕掛けの元`,1,`木の柱`,10,"","","","",6,],
[`${leader}仕掛けの元`,1,`火の仕掛け`,14,"","","","",5,],
[`${leader}仕掛けの元`,1,`火の仕掛け`,3,`ガスの仕掛け`,6,`氷の仕掛け`,3,6,],
[`${leader}シュラの像`,1,`水の像`,6,"","","","",7,],
[`炎の像`,4,`燭台`,11,"","","","",5,],
[`天草 四郎`,1,"","","","","","",8,],
[`${leader}からくり源内`,1,`電極`,6,"","","","",8,],
[`淀君（人間形態）`,1,`燭台`,4,"","","","",7,],
[`淀君（本体）`,1,`燭台`,4,"","","","",9,],
[`宮本 武蔵`,1,"","","","","","",11,],
[`魔神竜之介`,1,`燭台`,4,"","","","",16,],
[`岩間さま`,1,"","","","","","",15,],
[`カラクリ丸`,1,"","","","","","",`-`,`-`,],
[`炎魔の手の者`,4,"","","","","","",`-`,`-`,],
[`ハヤテ`,1,"","","","","","",`-`,`-`,],
[`尾手 院王（銃有り）`,1,"","","","","","",`-`,`-`,],
[`尾手 院王（銃無し）`,1,"","","","","","",`-`,`-`,],
[`ガマヘビ変化`,1,"","","","","","",`-`,`-`,],
];

const enemP_kunf = [
[`虎`,1,"","","","","","",4,],
[`レイ`,1,"","","","","","",`-`,`-`,],
[`サモ`,1,"","","","","","",`-`,`-`,],
[`ユン`,1,"","","","","","",`-`,`-`,],
[`（修行）`,1,"","","","","","",9,],
[`孫子王`,1,`荒くれ者`,2,"","","","",`-`,`-`,],
[`義破門団員（青服）`,2,"","","","","","",6,],
[`義破門団員（青服）`,5,"","","","","","",8,],
[`義破門団員（青服）`,9,"","","","","","",9,],
[`義破門団員（黒服）`,1,"","","","","","",7,],
[`義破門団員（黒服）`,5,"","","","","","",10,],
[`猛虎`,1,"","","","","","",6,],
[`猛虎`,2,"","","","","","",9,],
[`チュンチャンパイ`,5,`テーブル`,1,"","","","",10,],
[`義破門団員（青服）`,2,`猛虎`,1,"","","","",9,],
[`サンシ`,1,`スーシ`,1,"","","","",8,],
[`イーシ`,1,`アルシ`,1,"","","","",8,],
[`トンチャ`,1,`シャーチャ`,1,"","","","",9,],
[`ペイチャ`,1,`ナンチャ`,1,"","","","",9,],
[`リン`,1,`シャン`,1,`チャン`,1,"","",11,],
[`イーペイコウ`,1,"","","","","","",12,],
[`オディワン・リー`,1,"","","","","","",`-`,`-`,],
];

const enemP_gnda = [
[`ナムキャット`,1,"","","","","","",`-`,],
[`グレートエイジャ`,1,"","","","","","",`-`,],
[`トゥーラ・ハン`,1,"","","","","","",`-`,],
[`森部 生士`,1,"","","","","","",`-`,],
[`マックスモーガン`,1,"","","","","","",`-`,],
[`Ｊ・イヤウケア`,1,"","","","","","",`-`,],
[`オディ・Ｏ`,1,"","","","","","",`-`,],
];

const enemP_gnsi = [
[`ころワン`,4,"","","","","","",3,],
[`シンテトケラス♀`,1,"","","","","","",4,],
[`ころワン`,6,"","","","","","",3,],
[`ころワン`,2,`ちびマンモス`,1,"","","","",4,],
[`ちびマンモス`,3,"","","","","","",4,],
[`シンテトケラス♂`,1,`シンテトケラス♀`,1,"","","","",5,],
[`アーケオテリウム♂`,1,`アーケオテリウム♀`,1,"","","","",5,],
[`原始バイソン♂`,1,"","","","","","",6,],
[`原始バイソン♀`,1,`モア♀`,2,"","","","",8,],
[`サーベルタイガー♀`,2,"","","","","","",8,],
[`サーベルタイガー♂`,1,`サーベルタイガー♀`,1,"","","","",8,],
[`モア♂`,1,`モア♀`,1,"","","","",8,],
[`サーベルタイガー♂`,3,`サーベルタイガー♀`,3,"","","","",9,],
[`原始バイソン♂`,3,`原始バイソン♀`,1,"","","","",9,],
[`サーベルタイガー♂`,2,`サーベルタイガー♀`,2,"","","","",9,],
[`原始バイソン♂`,1,`原始バイソン♀`,1,"","","","",9,],
[`ナウマンゾウ♂`,1,"","","","","","",10,],
[`ナウマンゾウ♀`,1,"","","","","","",10,],
[`モア♂`,3,`サーベルタイガー♀`,2,"","","","",10,],
[`ナウマンゾウ♂`,1,`サーベルタイガー♀`,3,"","","","",12,],
[`ナウマンゾウ♀`,1,`ナウマンゾウ♂`,1,`ちびマンモス`,2,`サーベルタイガー♂`,2,13,],
[`ケケモグラ`,1,"","","","","","",3,],
[`ケケモグラ（※1）`,12,"","","","","","",5,],
[`ケケモグラ（※2）`,12,"","","","","","",5,],
[`アルコサウラ♂`,1,"","","","","","",6,],
[`ケケモグラ`,1,`アルコサウラ♀`,1,"","","","",6,],
[`アルコサウラ♂`,1,`アルコサウラ♀`,1,"","","","",9,],
[`アルコサウラ♂`,1,`アルコサウラ♀`,3,"","","","",11,],
[`アーケオテリウム♂`,1,`アーケオテリウム♀`,7,"","","","",7,],
[`ブロントテリウム♂`,1,`ブロントテリウム♀`,1,"","","","",7,],
[`サーベルタイガー♀`,3,`ブロントテリウム♂`,1,`ブロントテリウム♀`,1,"","",8,],
[`ブロントテリウム♀`,1,`アーケオテリウム♀`,2,"","","","",8,],
[`マンモス♀`,2,`ちびマンモス`,1,"","","","",10,],
[`ファルラルコス♂`,2,`サーベルタイガー♀`,3,"","","","",10,],
[`マンモス♀`,2,`アーケオテリウム♀`,4,"","","","",10,],
[`ファルラルコス♀`,3,`アーケオテリウム♂`,2,"","","","",10,],
[`ファルラルコス♀`,1,`ファルラルコス♂`,1,"","","","",11,],
[`ブロントテリウム♂`,4,"","","","","","",11,],
[`マンモス♂`,1,`サーベルタイガー♀`,2,"","","","",12,],
[`マンモス♂`,1,`ちびマンモス`,1,"","","","",12,],
[`マンモス♀`,1,`ブロントテリウム♀`,2,"","","","",13,],
[`クー族`,5,"","","","","","",7,],
[`ざき（1回目）`,1,"","","","","","",4,],
[`ざき（2回目）`,1,"","","","","","",4,],
[`クー族`,2,"","","","","","",6,],
[`クー族`,15,"","","","","","",10,],
[`ざき（3回目）`,1,"","","","","","",`-`,`-`,],
[`キングマンモー`,1,"","","","","","",18,],
[`おーでぃーおー`,1,"","","","","","",`-`,`-`,],
];

const enemP_seib = [
[`マッドドッグ`,1,"","","","","","",`-`,],
[`パイク`,1,"","","","","","",`-`,],
[`${leader}ディオ`,1,`デュオ・デ・チコ(または)岩`,2,`ダットン兄弟`,`0～6`,`パイク兄弟`,`0～6`,`-`,],
];

const enemP_chus = [
[`アイアンビートル`,3,"","","","","","",3,],
[`ライトライダー`,3,"","","","","","",3,],
[`シャープストロー`,2,"","","","","","",3,],
[`シングイーター`,4,"","","","","","",3,],
[`アイアンビートル`,6,"","","","","","",4,],
[`シャープストロー`,1,`シングイーター`,2,"","","","",4,],
[`ライトライダー`,9,"","","","","","",5,],
[`フリーザイン`,2,`ファングイーター`,2,"","","","",4,],
[`ファングイーター`,4,"","","","","","",4,],
[`ファングイーター`,2,`クールバルブ`,1,"","","","",4,],
[`クールバルブ`,2,`ファングイーター`,1,"","","","",4,],
[`クールバルブ`,1,`アームストロング`,1,`フリーザイン`,2,"","",6,],
[`ナギーベア`,1,"","","","","","",8,],
[`マンダイン`,7,"","","","","","",5,],
[`シングイーター`,1,`アイアンビートル`,3,`シャープストロー`,1,"","",5,],
[`シングイーター`,1,`シャープストロー`,7,"","","","",6,],
[`レッサードラゴン`,1,"","","","","","",6,],
[`リキッドストロー`,7,"","","","","","",6,],
[`レッサードラゴン`,1,`バーンバルブ`,2,`ホットビートル`,2,"","",8,],
[`バーンバルブ`,2,`レッサードラゴン`,1,"","","","",8,],
[`リキッドストロー`,4,`レッサードラゴン`,1,"","","","",8,],
[`ホットビートル`,1,`レッサードラゴン`,1,`ドラグノン`,1,"","",8,],
[`${leader}アームストロング`,1,`バーンバルブ`,7,"","","","",9,],
[`王国兵（※1）`,2,"","","","","","",8,],
[`王国兵（※2）`,2,"","","","","","",8,],
[`王国兵`,3,"","","","","","",9,],
[`王国兵`,4,"","","","","","",9,],
[`${leader}グリーンナイト`,1,`王国兵`,2,"","","","",10,],
[`王国兵`,2,`${leader}グリーンナイト`,1,"","","","",10,],
[`グリーンナイト`,3,"","","","","","",12,],
[`ナギーベア`,1,`クールバルブ`,3,`ファングイーター`,2,"","",11,],
[`ナギーベア`,2,"","","","","","",15,],
[`アラクノフォビア`,1,`バーンバルブ`,2,"","","","",9,],
[`アヌビノフォビア`,1,"","","","","","",10,],
[`エントモフォビア`,3,"","","","","","",10,],
[`アヌビノフォビア`,1,`レッサードラゴン`,1,"","","","",10,],
[`エントモフォビア`,1,`リキッドストロー`,1,"","","","",10,],
[`アラクノフォビア`,1,`バーンバルブ`,4,"","","","",11,],
[`ドラグノフォビア`,1,`レッサードラゴン`,2,"","","","",12,],
[`アラクノフォビア`,1,`レッサードラゴン`,1,"","","","",12,],
[`ドラグノフォビア`,2,"","","","","","",9,],
[`ドラグノフォビア`,1,`エントモフォビア`,1,"","","","",9,],
[`リキッドストロー`,2,`ドラグノン`,2,`エントモフォビア`,1,"","",9,],
[`アヌビノフォビア`,1,`ドラグノフォビア`,1,"","","","",11,],
[`アヌビノフォビア`,2,`レッサードラゴン`,1,"","","","",11,],
[`ドラグノフォビア`,1,`アラクノフォビア`,2,"","","","",12,],
[`アームストロング`,1,"","","","","","",4,],
[`ストレイボウ`,1,"","","","","","",`4以上`,],
[`ドラグノン`,1,"","","","","","",4,],
[`魔王`,1,"","","","","","",`-`,`-`,],
[`魔王（ルクレチア城）`,1,"","","","","","",`-`,`-`,],
[`王国兵（城脱出時）`,1,"","","","","","",6,],
[`王国兵（城脱出時）`,2,"","","","","","",6,],
[`王国兵（城脱出時）`,7,"","","","","","",8,],
[`クラウストロＰＨ`,1,"","","","","","",14,],
[`スコトフォビア`,1,"","","","","","",14,],
[`アクロフォビア`,4,`${leader}アクロフォビア器`,1,"","","","",15,],
[`フェミノフォビア`,1,"","","","","","",16,],
[`ストレイボウ（魔王山）`,1,"","","","","","",`-`,`-`,],
];

const enemP_sais = [
[`ザビエール`,1,"","","","","","",5,],
[`オイディプス`,1,`ダイダロス`,1,`${leader}ポリディクティス`,1,"","",5,],
[`クイーンテイル`,3,"","","","","","",6,],
[`ポウンバード`,2,"","","","","","",10,],
[`${leader}ルビータイラント`,1,`ケルベロ`,4,"","","","",7,],
[`ヌーベルルミエル`,1,"","","","","","",8,],
[`ソウルイーター`,2,`ホラーバルブ`,2,"","","","",7,],
[`ファントム`,1,`亡拳士`,2,"","","","",10,],
[`クロノレギオン`,3,"","","","","","",11,],
[`ベアナックル`,1,"","","","","","",11,],
[`猫又`,4,"","","","","","",11,],
[`強腕戦車`,2,`${leader}メカサタケ９８`,1,"","","","",13,],
[`ブラキオペルタ`,1,`エントモパイラム`,2,"","","","",11,],
[`クイーンテイル`,8,"","","","","","",9,],
[`亡拳士`,3,`猫又`,2,"","","","",10,],
[`ファントム`,2,`亡拳士`,4,`岩`,2,"","",11,],
[`グラシャラボラス`,2,"","","","","","",15,],
[`${leader}メカサタケ９８`,1,`強腕戦車`,1,`大顔面`,3,"","",13,],
[`エントモパイラム`,2,`ファントム`,1,"","","","",13,],
[`グラシャラボラス`,1,`ソウルイーター`,4,"","","","",13,],
[`ヌーベルルミエル`,1,`バーバリアン`,6,"","","","",11,],
[`大顔面`,3,`${leader}マスタードラゴン`,1,"","","","",12,],
[`イシュタール`,1,"","","","","","",20,],
[`ベアナックル`,1,`ヌーベルルミエル`,3,"","","","",12,],
[`グラングラス`,1,`大顔面`,2,"","","","",14,],
[`グラングラス`,1,`ホラーバルブ`,2,"","","","",13,],
[`${leader}ツナヨシ`,1,`おイヌ様`,14,"","","","",14,],
[`グラングラス`,2,"","","","","","",15,],
[`グラシャラボラス`,2,`ベアナックル`,2,"","","","",14,],
[`ピスタチオ`,1,`グラシャラボラス`,4,"","","","",17,],
[`${leader}ツナヨシ`,1,`${leader}ルビータイラント`,1,`おイヌ様`,9,`ケルベロ`,4,17,],
[`${leader}マスタードラゴン`,1,`ピスタチオ`,2,"","","","",17,],
[`グラングラス`,1,`バーバリアン`,9,"","","","",18,],
[`${leader}マスタードラゴン`,2,`ピスタチオ`,5,"","","","",18,],
[`ティタンブラッド`,1,"","","","","","",19,],
[`次元　源左衛門`,3,"","","","","","",18,],
[`コロコロムシ`,1,"","","","","","",17,],
[`次元　源左衛門`,1,`クロノレギオン`,1,`バーバリアン`,2,`ファントム`,1,20,],
[`${leader}ティタンブラッド`,1,`ピスタチオ`,14,"","","","",20,],
[`ホラーシップ`,1,"","","","","","",22,],
[`バロクレスト`,1,`グラングラス`,1,"","","","",21,],
[`リンバースキュラ`,4,"","","","","","",22,],
[`バロクレスト`,2,"","","","","","",23,],
[`グラングラス`,1,`グラシャラボラス`,1,`猫又`,3,"","",22,],
[`岩`,5,`${leader}マスタードラゴン`,4,`ピスタチオ`,6,"","",25,],
[`ポワッシー`,1,"","","","","","",25,],
[`岩`,4,`コロコロムシ`,8,`ピスタチオ`,2,`${leader}マスタードラゴン`,1,26,],
[`ヘリオスハウント`,2,"","","","","","",25,],
[`次元　源左衛門`,2,`ソウルイーター`,13,"","","","",25,],
[`ホラーシップ`,1,`コロコロムシ`,4,"","","","",27,],
[`グラングラス`,1,`ベアナックル`,1,`ヌーベルルミエル`,1,`ケルベロ`,12,27,],
[`ワールダーク`,1,"","","","","","",32,],
[`バロクレスト`,1,`次元　源左衛門`,1,`亡拳士`,8,"","",28,],
[`イシュタール`,1,`ティタンブラッド`,1,"","","","",29,],
[`ポワッシー`,1,`バロクレスト`,1,`リンバースキュラ`,2,`ブラキオペルタ`,1,30,],
[`ワールダーク`,1,`イシュタール`,1,`ホラーシップ`,1,"","",35,],
[`影`,1,"","","","","","",12,],
[`アポフィスフィオ`,1,"","","","","","",20,],
[`ボイスハート`,1,"","","","","","",10,],
[`ユラウクス`,1,"","","","","","",20,],
[`ジャギィイエッグ`,4,"","","","","","",20,],
[`アムルクレチア`,1,"","","","","","",20,],
[`ヘッドプラッカー`,1,"","","","","","",24,],
[`デスプロフェット`,1,"","","","","","",24,],
[`オディオアイ`,2,`オディオモール`,1,`オディオマウス`,1,"","",`-`,`-`,],
[`ピュアオディオ`,1,"","","","","","",`-`,`-`,],
[`オルステッド(NEVER END)`,1,"","","","","","",`-`,`-`,],
[`マザーＣＯＭ(最終編)`,1,"","","","","","",`-`,`-`,],
[`オディワン・リー(最終編)`,1,"","","","","","",`-`,`-`,],
[`ガマヘビ変化(最終編)`,1,"","","","","","",`-`,`-`,],
[`おーでぃーおー(最終編)`,1,"","","","","","",`-`,`-`,],
[`オディ・Ｏ(最終編)`,1,"","","","","","",`-`,`-`,],
[`ディオ(最終編)`,1,"","","","","","",`-`,`-`,],
[`大隠呼像(最終編)`,1,"","","","","","",`-`,`-`,],
[`Ｓｉｎオディオ`,1,`オディオアーム`,2,"","","","",`-`,`-`,],
];

//チェックボックス
const scenarioBox = [
	d.getElementById("kinmirai"),
	d.getElementById("sf"),
	d.getElementById("bakumatsu"),
	d.getElementById("kunfu"),
	d.getElementById("gendai"),
	d.getElementById("genshi"),
	d.getElementById("seibu"),
	d.getElementById("chusei"),
	d.getElementById("saishu"),
];

//敵リストシナリオ別一覧
const enemP = [
	enemP_kinm,
	enemP_sf,
	enemP_baku,
	enemP_kunf,
	enemP_gnda,
	enemP_gnsi,
	enemP_seib,
	enemP_chus,
	enemP_sais,
];

//取得経験値計算用の関数expCalc
function expCalc(aLV,eLV){
	let expText = "";
	if ( eLV === "-" ) {
		expText = "-";
	} else if ( ( eLV === `4以上` )&&(/^[1-9][0-9]?$/.test(aLV)) ) {
		expText = `56以上<br>(※下注意参照)`;	//ストレイボウ戦用
	} else if ( !(/^[1-9][0-9]?$/.test(aLV)) ) {
		expText = "-";	// 整数値判定
	} else {
		const
		// レベル値(string)を数値(number)変換
		aLvN = Number(aLV),
		// 敵パーティレベル[仮] - 味方キャラレベル
		lvSub = eLV - aLvN;
		//レベル差の値で分岐
		if ( 2 <= lvSub) {
			expText = Math.min((lvSub * 16 + 8),100);	//計算結果が100以上なら100に切り捨て処理
		} else if ( ( -2 <= lvSub ) && ( lvSub <= 1 ) ) {
			expText = Math.floor(36 / (3 - lvSub));
		} else {
			expText = 5;
		}
	}
	return expText;
}

//テーブル一覧を作る関数expTable（ボタンクリックorラジオボタンチェックで実行）
function expTable(){
	d.getElementById("view").replaceChildren();	//div内削除
	//表一番下の注意事項
	let attention = "";
	if (scenarioBox[0].checked) {
		attention += `<h5>近未来編注記：</h5><p>（※1）ＲＣ１号が斜め配置、（※2）ＲＣ１号が横一列配置、（※3）ＲＣ２号が直角配置、（※4）ＲＣ２号が4・4に分割配置、（※5, 6）怒竜戦は、怒竜のシンボルが飛び回っている時と、御出居寺突入時とで配置が異なる別パーティになる（左右反転する）</p>`;
	}
	if (scenarioBox[5].checked) {
		attention += `<h5>原始編注記：</h5><p>（※1）（※2）ケケモグラ×12の敵パーティは2パターンあり、敵・味方初期位置が異なる。</p>`;
	}
	if (scenarioBox[7].checked) {
		attention += `<h5>中世編注記：</h5><ul><li>ストレイボウ戦の取得経験値の正確な計算は不可能。<br>詳細は&#x25b6;<a href="../battle13.html">基礎知識 &gt; 経験値</a>を参照。</li><li>王国兵×2（※1）と王国兵×2（※2）のパーティは、初期配置が異なる別パーティの扱いになる。また、ルクレチア城から脱出する際にも王国兵×2（城脱出時）が登場するが、敵パーティレベル[仮]が異なる別パーティ扱い。<br>詳細は&#x25b6;<a href="../re_chusei/enemy2.html">中世編 &gt; データ集 &gt; 敵データ（敵パーティ一覧）</a>を参照。</li></ul>`;
	}

	//表作成
	//ヘッダ
	let resultText = "<table><thead><tr><th>シナリオ</th><th>名前&#x2460;</th><th>数</th><th>名前&#x2461;</th><th>数</th><th>名前&#x2462;</th><th>数</th><th>名前&#x2463;</th><th>数</th><th>敵PtLV[仮]</th><th>取得経験値</th></tr></thead><tbody>";
	//ラジオボタンにチェックが入っていたら、シナリオ毎に表作る
	for (let x = 0; x < scenarioBox.length; x++) {
		if (scenarioBox[x].checked) {
			let tabletd = "";
			let tabletbody = "";
			for (let j = 0; j < enemP[x].length; j++) {
				tabletd = `<tr id="${x}_${j}"><td>${SNo[x]}</td>`;
				for (let i = 0; i < enemP[x][0].length; i++) {
					tabletd += `<td>${enemP[x][j][i]}</td>`;
				}
			//getElementByIdで味方キャラレベル(string)を取得し、最後のセルに関数expCalcで取得経験値計算値入れる
			const lev = escapeHtml(d.getElementById('num1').value);
			tabletd += `<td>${expCalc(lev,enemP[x][j][8])}</td>`;
			tabletd += "</tr>";
			tabletbody += tabletd;
			}
			resultText += tabletbody
		}
	}
	//表をinsertAdjacentHTMLで入れる
	d.getElementById("view").insertAdjacentHTML("afterbegin", (resultText + "</tbody></table>" + attention));
}

//関数expTableを実行して、初期値を表示する
expTable();

//ボタンクリックで関数expTable実行
d.getElementById("expcal").addEventListener("click", expTable);

//ラジオボタンチェックで関数expTable実行
d.getElementById("radiobtn").addEventListener("change", expTable);

//HTMLエスケープ
function escapeHtml(str) {
	str = str.replace(/&/g, '&amp;');
	str = str.replace(/</g, '&lt;');
	str = str.replace(/>/g, '&gt;');
	str = str.replace(/"/g, '&quot;');
	str = str.replace(/'/g, '&#39;');
	return str;
}

}