//原始編　アイテム合成
{
const d = document,

// 合成アイテム一覧
i = ["かわひも","つけムナゲ","ぼいんビーナス","メラメラこんぼう","ウホホマスク","カチンコケース","ガツングローブ","キバのネックレス","キバキバこんぼう","ギギガガのワッカ","ケモノかぶり","ツンツンヤリ","ドカドカオノ","ハナかざり","ビリビリまきびし","ブンブンナイフ","ブンブンホネ","ブスブスヤリ","ペシペシムチ","ボーラ","ポコポコドラム","石器ナイフ","野性アーマー","野性ドレス","野性バッグ","※同じアイテム同士は合成不可"],

// 合成リスト
itemlist = [
	[i[25],i[11],i[11],i[8],i[3],i[12],i[20],i[18],i[17]],
	[i[11],i[25],i[9],i[13],i[10],i[21],i[20],i[16],i[17]],
	[i[11],i[9],i[25],i[13],i[10],i[9],i[4],i[5],i[5]],
	[i[8],i[13],i[13],i[25],i[1],i[13],i[4],i[7],i[14]],
	[i[3],i[10],i[10],i[1],i[25],i[1],i[1],i[23],i[0]],
	[i[12],i[21],i[9],i[13],i[1],i[25],i[6],i[19],i[2]],
	[i[20],i[20],i[4],i[4],i[1],i[6],i[25],i[24],i[22]],
	[i[18],i[16],i[5],i[7],i[23],i[19],i[24],i[25],i[15]],
	[i[17],i[17],i[5],i[14],i[0],i[2],i[22],i[15],i[25]],
],

// 材料アイテム一覧
s = ["木の棒","ホネ","ケモノのツノ","ケモノのキバ","ケガワ","かたい石","かたいカワ",i[0],i[21]],

t = [`※${i[21]}←${s[1]} + ${s[5]}`,`※${i[0]}←${s[4]} + ${i[21]}`,],

// 材料アイテム合成
materialItem = [
	`${s[4]} + ${s[8]}<br><br>${t[0]}`,
	`${s[3]} + ${s[4]}<br>${s[4]} + ${s[5]}<br>${s[4]} + ${s[6]}`,
	`${s[5]} + ${s[8]}<br><br>${t[0]}`,
	`${s[0]} + ${s[4]}`,
	`${s[2]} + ${s[6]}<br>${s[3]} + ${s[6]}`,
	`${s[2]} + ${s[7]}<br>${s[2]} + ${s[8]}<br><br>${t[1]}<br>${t[0]}`,
	`${s[5]} + ${s[6]}`,
	`${s[3]} + ${s[7]}<br><br>${t[1]}<br>${t[0]}`,
	`${s[0]} + ${s[3]}`,
	`${s[1]} + ${s[2]}<br>${s[2]} + ${s[5]}`,
	`${s[1]} + ${s[4]}<br>${s[2]} + ${s[4]}`,
	`${s[0]} + ${s[1]}<br>${s[0]} + ${s[2]}`,
	`${s[0]} + ${s[5]}`,
	`${s[1]} + ${s[3]}<br>${s[2]} + ${s[3]}<br>${s[3]} + ${s[5]}`,
	`${s[3]} + ${s[8]}<br><br>${t[0]}`,
	`${s[7]} + ${s[8]}<br><br>${t[1]}<br>${t[0]}`,
	`${s[1]} + ${s[7]}<br><br>${t[1]}<br>${t[0]}`,
	`${s[0]} + ${s[8]}<br>${s[1]} + ${s[8]}<br><br>${t[0]}`,
	`${s[0]} + ${s[7]}<br><br>${t[1]}<br>${t[0]}`,
	`${s[5]} + ${s[7]}<br><br>${t[1]}<br>${t[0]}`,
	`${s[0]} + ${s[6]}<br>${s[1]} + ${s[6]}`,
	`${s[1]} + ${s[5]}`,
	`${s[6]} + ${s[8]}<br><br>${t[0]}`,
	`${s[4]} + ${s[7]}<br><br>${t[1]}<br>${t[0]}`,
	`${s[6]} + ${s[7]}<br><br>${t[1]}<br>${t[0]}`,
];

// アイテム合成
d.getElementById("formg").addEventListener("change", () => d.getElementById("view1").innerHTML = itemlist[d.getElementById("selectForm1").selectedIndex][d.getElementById("selectForm2").selectedIndex]);

// アイテム合成逆引き（材料検索）
d.getElementById("formk").addEventListener("change", () => d.getElementById("view2").innerHTML = materialItem[d.getElementById("selectForm3").selectedIndex]);
}